---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadResult.GetModelName
source: html/b2192b76-593d-53f4-3792-2dd81a4da6c4.htm
---
# Autodesk.Revit.DB.LinkLoadResult.GetModelName Method

Gets the name of the model.

## Syntax (C#)
```csharp
public ModelPath GetModelName()
```